
let data = [
    [
        1259539,
        9.6,
        142,
        "肖申克的救赎 The Shawshank Redemption",
        "剧情犯罪"
    ],
    [
        928982,
        9.6,
        171,
        "霸王别姬",
        "剧情爱情同性"
    ],
    [
        1156900,
        9.4,
        110,
        "这个杀手不太冷 Léon",
        "剧情动作犯罪"
    ],
    [
        992897,
        9.4,
        142,
        "阿甘正传 Forrest Gump",
        "剧情爱情"
    ],
    [
        580574,
        9.5,
        116,
        "美丽人生 La vita è bella",
        "剧情喜剧爱情战争"
    ],
    [
        928893,
        9.3,
        194,
        "泰坦尼克号 Titanic",
        "剧情爱情灾难"
    ],
    [
        922576,
        9.3,
        125,
        "千与千寻 千と千尋の神隠し",
        "剧情动画奇幻"
    ],
    [
        520772,
        9.5,
        195,
        "辛德勒的名单 Schindler's List",
        "剧情历史战争"
    ],
    [
        1006886,
        9.3,
        148,
        "盗梦空间 Inception",
        "剧情科幻悬疑冒险"
    ],
    [
        669198,
        9.3,
        98,
        "机器人总动员 WALL·E",
        "爱情科幻动画冒险"
    ],
    [
        655663,
        9.3,
        93,
        "忠犬八公的故事 Hachi: A Dog's Tale",
        "剧情"
    ],
    [
        901967,
        9.2,
        171,
        "三傻大闹宝莱坞 3 Idiots",
        "剧情喜剧爱情歌舞"
    ],
    [
        751496,
        9.2,
        165,
        "海上钢琴师 La leggenda del pianista sull'oceano",
        "剧情音乐"
    ],
    [
        621518,
        9.2,
        97,
        "放牛班的春天 Les choristes",
        "剧情音乐"
    ],
    [
        690487,
        9.2,
        95,
        "大话西游之大圣娶亲 西遊記大結局之仙履奇緣",
        "喜剧爱情奇幻冒险"
    ],
    [
        672973,
        9.2,
        103,
        "楚门的世界 The Truman Show",
        "剧情科幻"
    ],
    [
        607643,
        9.1,
        86,
        "龙猫 となりのトトロ",
        "动画奇幻冒险"
    ],
    [
        684592,
        9.2,
        169,
        "星际穿越 Interstellar",
        "剧情科幻冒险"
    ],
    [
        455506,
        9.2,
        175,
        "教父 The Godfather",
        "剧情犯罪"
    ],
    [
        391789,
        9.3,
        125,
        "熔炉 도가니",
        "剧情"
    ],
    [
        567802,
        9.1,
        101,
        "无间道 無間道",
        "剧情悬疑犯罪"
    ],
    [
        729324,
        9,
        117,
        "当幸福来敲门 The Pursuit of Happyness",
        "剧情家庭传记"
    ],
    [
        482466,
        9.2,
        112,
        "触不可及 Intouchables",
        "剧情喜剧"
    ],
    [
        757638,
        9.2,
        109,
        "疯狂动物城 Zootopia",
        "喜剧动画冒险"
    ],
    [
        789603,
        9,
        90,
        "怦然心动 Flipped",
        "剧情喜剧爱情"
    ],
    [
        343846,
        9.2,
        238,
        "乱世佳人 Gone with the Wind",
        "剧情爱情历史战争"
    ],
    [
        457139,
        9.1,
        152,
        "蝙蝠侠：黑暗骑士 The Dark Knight",
        "剧情动作科幻惊悚犯罪"
    ],
    [
        374950,
        9.2,
        132,
        "活着",
        "剧情家庭历史"
    ],
    [
        376094,
        9.1,
        155,
        "天堂电影院 Nuovo Cinema Paradiso",
        "剧情爱情"
    ],
    [
        742707,
        9,
        127,
        "少年派的奇幻漂流 Life of Pi",
        "剧情奇幻冒险"
    ],
    [
        221535,
        9.4,
        96,
        "十二怒汉 12 Angry Men",
        "剧情"
    ],
    [
        308772,
        9.2,
        139,
        "鬼子来了",
        "剧情历史战争"
    ],
    [
        369718,
        9.1,
        201,
        "指环王3：王者无敌 The Lord of the Rings: The Return of the King",
        "剧情动作奇幻冒险"
    ],
    [
        153476,
        9.6,
        116,
        "控方证人 Witness for the Prosecution",
        "剧情悬疑犯罪"
    ],
    [
        432231,
        9.1,
        125,
        "天空之城 天空の城ラピュタ",
        "动画奇幻冒险"
    ],
    [
        484637,
        9,
        139,
        "搏击俱乐部 Fight Club",
        "剧情动作悬疑惊悚"
    ],
    [
        657762,
        8.9,
        96,
        "飞屋环游记 Up",
        "剧情喜剧动画冒险"
    ],
    [
        556824,
        8.9,
        87,
        "大话西游之月光宝盒 西遊記第壹佰零壹回之月光寶盒",
        "喜剧爱情奇幻冒险"
    ],
    [
        679587,
        9.1,
        161,
        "摔跤吧！爸爸 Dangal",
        "剧情家庭传记运动"
    ],
    [
        496516,
        9,
        118,
        "罗马假日 Roman Holiday",
        "剧情喜剧爱情"
    ],
    [
        471625,
        8.9,
        119,
        "哈尔的移动城堡 ハウルの動く城",
        "动画奇幻冒险"
    ],
    [
        294831,
        9.1,
        137,
        "窃听风暴 Das Leben der Anderen",
        "剧情悬疑"
    ],
    [
        421649,
        9,
        157,
        "闻香识女人 Scent of a Woman",
        "剧情"
    ],
    [
        291995,
        9.2,
        127,
        "辩护人 변호인",
        "剧情"
    ],
    [
        332144,
        9.1,
        107,
        "两杆大烟枪 Lock, Stock and Two Smoking Barrels",
        "剧情喜剧犯罪"
    ],
    [
        335575,
        9.1,
        133,
        "飞越疯人院 One Flew Over the Cuckoo's Nest",
        "剧情"
    ],
    [
        360910,
        9,
        128,
        "死亡诗社 Dead Poets Society",
        "剧情"
    ],
    [
        547357,
        8.8,
        132,
        "V字仇杀队 V for Vendetta",
        "剧情动作科幻惊悚"
    ],
    [
        346926,
        9,
        179,
        "指环王2：双塔奇兵 The Lord of the Rings: The Two Towers",
        "剧情动作奇幻冒险"
    ],
    [
        246516,
        9.1,
        202,
        "教父2 The Godfather: Part Ⅱ",
        "剧情犯罪"
    ],
    [
        221065,
        9.3,
        92,
        "海豚湾 The Cove",
        "纪录片"
    ],
    [
        388451,
        8.9,
        178,
        "指环王1：魔戒再现 The Lord of the Rings: The Fellowship of the Ring",
        "剧情动作奇幻冒险"
    ],
    [
        267225,
        9.1,
        124,
        "饮食男女 飲食男女",
        "剧情家庭"
    ],
    [
        384209,
        8.9,
        135,
        "美丽心灵 A Beautiful Mind",
        "剧情传记"
    ],
    [
        254598,
        9.1,
        123,
        "素媛 소원",
        "剧情"
    ],
    [
        476796,
        8.8,
        117,
        "情书 Love Letter",
        "剧情爱情"
    ],
    [
        264624,
        9.1,
        163,
        "末代皇帝 The Last Emperor",
        "剧情传记历史"
    ],
    [
        367145,
        8.9,
        89,
        "狮子王 The Lion King",
        "剧情动画歌舞家庭冒险"
    ],
    [
        253315,
        9.1,
        150,
        "钢琴家 The Pianist",
        "剧情音乐传记历史战争"
    ],
    [
        218179,
        9.1,
        229,
        "美国往事 Once Upon a Time in America",
        "剧情犯罪"
    ],
    [
        184569,
        9.2,
        89,
        "小鞋子 بچههای آسمان",
        "剧情家庭儿童"
    ],
    [
        496312,
        8.8,
        166,
        "本杰明·巴顿奇事 The Curious Case of Benjamin Button",
        "剧情爱情奇幻"
    ],
    [
        528569,
        8.8,
        127,
        "七宗罪 Se7en",
        "剧情悬疑惊悚犯罪"
    ],
    [
        383001,
        8.9,
        130,
        "被嫌弃的松子的一生 嫌われ松子の一生",
        "剧情歌舞"
    ],
    [
        433555,
        8.8,
        130,
        "致命魔术 The Prestige",
        "剧情悬疑惊悚"
    ],
    [
        462732,
        8.8,
        109,
        "西西里的美丽传说 Malèna",
        "剧情情色战争"
    ],
    [
        500049,
        8.7,
        106,
        "看不见的客人 Contratiempo",
        "剧情悬疑惊悚犯罪"
    ],
    [
        365300,
        8.9,
        136,
        "黑客帝国 The Matrix",
        "动作科幻"
    ],
    [
        808080,
        8.7,
        132,
        "让子弹飞",
        "剧情喜剧动作西部"
    ],
    [
        313602,
        8.9,
        169,
        "拯救大兵瑞恩 Saving Private Ryan",
        "剧情历史战争"
    ],
    [
        290683,
        8.9,
        174,
        "音乐之声 The Sound of Music",
        "剧情爱情歌舞传记"
    ],
    [
        586466,
        8.7,
        122,
        "天使爱美丽 Le fabuleux destin d'Amélie Poulain",
        "喜剧爱情"
    ],
    [
        425284,
        8.8,
        154,
        "低俗小说 Pulp Fiction",
        "剧情喜剧犯罪"
    ],
    [
        145158,
        9.3,
        114,
        "大闹天宫",
        "动画奇幻"
    ],
    [
        372868,
        8.8,
        152,
        "哈利·波特与魔法石 Harry Potter and the Sorcerer's Stone",
        "奇幻冒险"
    ],
    [
        351039,
        8.8,
        177,
        "勇敢的心 Braveheart",
        "剧情动作传记历史战争"
    ],
    [
        597800,
        8.7,
        105,
        "剪刀手爱德华 Edward Scissorhands",
        "剧情爱情奇幻"
    ],
    [
        433297,
        8.8,
        118,
        "沉默的羔羊 The Silence of the Lambs",
        "剧情惊悚犯罪"
    ],
    [
        476688,
        8.7,
        113,
        "蝴蝶效应 The Butterfly Effect",
        "剧情科幻悬疑惊悚"
    ],
    [
        314629,
        8.9,
        96,
        "春光乍泄 春光乍洩",
        "剧情爱情同性"
    ],
    [
        346281,
        8.8,
        126,
        "心灵捕手 Good Will Hunting",
        "剧情"
    ],
    [
        369730,
        8.8,
        130,
        "入殓师 おくりびと",
        "剧情"
    ],
    [
        317679,
        8.8,
        141,
        "猫鼠游戏 Catch Me If You Can",
        "剧情传记犯罪"
    ],
    [
        419506,
        8.8,
        99,
        "布达佩斯大饭店 The Grand Budapest Hotel",
        "剧情喜剧冒险"
    ],
    [
        459381,
        8.7,
        138,
        "禁闭岛 Shutter Island",
        "剧情悬疑惊悚"
    ],
    [
        634479,
        9,
        105,
        "寻梦环游记 Coco",
        "喜剧动画音乐奇幻"
    ],
    [
        267141,
        8.9,
        92,
        "玛丽和马克思 Mary and Max",
        "剧情动画"
    ],
    [
        337829,
        8.8,
        134,
        "阳光灿烂的日子",
        "剧情"
    ],
    [
        291685,
        8.8,
        134,
        "幽灵公主 もののけ姫",
        "动画奇幻冒险"
    ],
    [
        289297,
        8.8,
        107,
        "第六感 The Sixth Sense",
        "剧情悬疑惊悚"
    ],
    [
        203696,
        9,
        94,
        "穿条纹睡衣的男孩 The Boy in the Striped Pajamas",
        "剧情战争"
    ],
    [
        412212,
        8.7,
        102,
        "重庆森林 重慶森林",
        "剧情爱情"
    ],
    [
        171359,
        9.1,
        115,
        "狩猎 Jagten",
        "剧情"
    ],
    [
        399026,
        8.7,
        90,
        "致命ID Identity",
        "剧情悬疑惊悚"
    ],
    [
        395860,
        8.7,
        134,
        "断背山 Brokeback Mountain",
        "剧情爱情同性家庭"
    ],
    [
        442881,
        8.7,
        143,
        "加勒比海盗 Pirates of the Caribbean: The Curse of the Black Pearl",
        "动作奇幻冒险"
    ],
    [
        662279,
        8.6,
        162,
        "阿凡达 Avatar",
        "动作科幻战争冒险"
    ],
    [
        120978,
        9.2,
        87,
        "摩登时代 Modern Times",
        "剧情喜剧爱情"
    ],
    [
        308048,
        8.8,
        125,
        "大鱼 Big Fish",
        "剧情家庭奇幻冒险"
    ],
    [
        417182,
        8.7,
        106,
        "告白",
        "剧情惊悚"
    ],
    [
        188184,
        9,
        173,
        "一一",
        "剧情爱情家庭"
    ],
    [
        336784,
        8.7,
        113,
        "射雕英雄传之东成西就 射鵰英雄傳之東成西就",
        "喜剧古装"
    ],
    [
        275736,
        8.8,
        118,
        "甜蜜蜜",
        "剧情爱情"
    ],
    [
        331825,
        8.8,
        124,
        "阳光姐妹淘 써니",
        "剧情喜剧"
    ],
    [
        451754,
        8.7,
        149,
        "消失的爱人 Gone Girl",
        "剧情悬疑惊悚犯罪"
    ],
    [
        277892,
        8.8,
        101,
        "爱在黎明破晓前 Before Sunrise",
        "剧情爱情"
    ],
    [
        412887,
        8.6,
        85,
        "喜剧之王 喜劇之王",
        "剧情喜剧爱情"
    ],
    [
        182493,
        8.9,
        130,
        "上帝之城 Cidade de Deus",
        "剧情犯罪"
    ],
    [
        183767,
        8.9,
        111,
        "小森林 夏秋篇 リトル・フォレスト 夏・秋",
        "剧情"
    ],
    [
        216644,
        8.8,
        111,
        "侧耳倾听 耳をすませば",
        "剧情爱情动画"
    ],
    [
        215983,
        8.8,
        117,
        "风之谷 風の谷のナウシカ",
        "动画奇幻冒险"
    ],
    [
        334950,
        8.7,
        98,
        "倩女幽魂",
        "剧情爱情武侠古装"
    ],
    [
        295157,
        8.7,
        97,
        "恐怖直播 더 테러 라이브",
        "剧情悬疑犯罪"
    ],
    [
        174958,
        8.9,
        90,
        "红辣椒 パプリカ",
        "科幻动画悬疑惊悚"
    ],
    [
        221034,
        8.8,
        97,
        "超脱 Detachment",
        "剧情"
    ],
    [
        244542,
        8.8,
        80,
        "爱在日落黄昏时 Before Sunset",
        "剧情爱情"
    ],
    [
        237022,
        8.8,
        121,
        "菊次郎的夏天 菊次郎の夏",
        "剧情喜剧"
    ],
    [
        358756,
        8.7,
        98,
        "驯龙高手 How to Train Your Dragon",
        "喜剧动画奇幻冒险"
    ],
    [
        272617,
        8.7,
        128,
        "幸福终点站 The Terminal",
        "剧情喜剧爱情"
    ],
    [
        253343,
        8.8,
        132,
        "请以你的名字呼唤我 Call Me by Your Name",
        "剧情爱情同性"
    ],
    [
        484875,
        8.5,
        95,
        "神偷奶爸 Despicable Me",
        "喜剧动画冒险"
    ],
    [
        267004,
        8.7,
        94,
        "借东西的小人阿莉埃蒂 借りぐらしのアリエッティ",
        "动画奇幻冒险"
    ],
    [
        258911,
        8.7,
        130,
        "杀人回忆 살인의 추억",
        "剧情悬疑惊悚犯罪"
    ],
    [
        347885,
        8.7,
        130,
        "哈利·波特与死亡圣器(下) Harry Potter and the Deathly Hallows: Part 2",
        "剧情悬疑奇幻冒险"
    ],
    [
        159634,
        9,
        120,
        "小森林 冬春篇 リトル・フォレスト 冬・春",
        "剧情"
    ],
    [
        96260,
        9.2,
        160,
        "七武士 七人の侍",
        "剧情动作冒险"
    ],
    [
        357493,
        8.6,
        117,
        "岁月神偷 歲月神偷",
        "剧情家庭"
    ],
    [
        308603,
        8.6,
        92,
        "怪兽电力公司 Monsters, Inc.",
        "喜剧动画儿童奇幻冒险"
    ],
    [
        383746,
        8.5,
        135,
        "真爱至上 Love Actually",
        "剧情喜剧爱情"
    ],
    [
        243421,
        8.7,
        89,
        "萤火虫之墓 火垂るの墓",
        "剧情动画战争"
    ],
    [
        227423,
        8.7,
        127,
        "7号房的礼物 7번방의 선물",
        "剧情喜剧家庭"
    ],
    [
        222536,
        8.7,
        115,
        "谍影重重3 The Bourne Ultimatum",
        "动作悬疑惊悚"
    ],
    [
        243472,
        8.7,
        103,
        "电锯惊魂 Saw",
        "悬疑惊悚恐怖"
    ],
    [
        450717,
        8.7,
        98,
        "疯狂原始人 The Croods",
        "喜剧动画冒险"
    ],
    [
        210317,
        8.8,
        45,
        "萤火之森 蛍火の杜へ",
        "剧情爱情动画奇幻"
    ],
    [
        313307,
        8.6,
        100,
        "东邪西毒 東邪西毒",
        "剧情动作爱情武侠古装"
    ],
    [
        171368,
        8.8,
        108,
        "喜宴 囍宴",
        "剧情喜剧爱情同性家庭"
    ],
    [
        455059,
        8.5,
        120,
        "贫民窟的百万富翁 Slumdog Millionaire",
        "剧情爱情"
    ],
    [
        472365,
        8.6,
        102,
        "超能陆战队 Big Hero 6",
        "喜剧动作科幻动画冒险"
    ],
    [
        442248,
        8.5,
        102,
        "唐伯虎点秋香 唐伯虎點秋香",
        "喜剧爱情古装"
    ],
    [
        334029,
        8.6,
        113,
        "记忆碎片 Memento",
        "剧情悬疑惊悚犯罪"
    ],
    [
        493005,
        8.5,
        108,
        "黑天鹅 Black Swan",
        "剧情惊悚"
    ],
    [
        358349,
        8.6,
        165,
        "蝙蝠侠：黑暗骑士崛起 The Dark Knight Rises",
        "剧情动作科幻惊悚犯罪"
    ],
    [
        226435,
        8.6,
        95,
        "英雄本色",
        "动作犯罪"
    ],
    [
        241736,
        8.7,
        133,
        "雨人 Rain Man",
        "剧情"
    ],
    [
        234053,
        8.7,
        110,
        "心迷宫",
        "剧情悬疑犯罪"
    ],
    [
        371656,
        8.5,
        129,
        "傲慢与偏见 Pride & Prejudice",
        "剧情爱情"
    ],
    [
        187479,
        8.8,
        122,
        "荒蛮故事 Relatos salvajes",
        "剧情喜剧犯罪"
    ],
    [
        144972,
        8.9,
        121,
        "卢旺达饭店 Hotel Rwanda",
        "剧情历史战争"
    ],
    [
        99372,
        9.1,
        141,
        "无人知晓 誰も知らない",
        "剧情"
    ],
    [
        190096,
        8.7,
        108,
        "纵横四海 緃横四海",
        "剧情喜剧动作犯罪"
    ],
    [
        256184,
        8.7,
        123,
        "时空恋旅人 About Time",
        "剧情爱情奇幻"
    ],
    [
        108866,
        9,
        104,
        "海洋 Océans",
        "纪录片"
    ],
    [
        402375,
        8.7,
        139,
        "血战钢锯岭 Hacksaw Ridge",
        "剧情传记历史战争"
    ],
    [
        162912,
        8.8,
        170,
        "教父3 The Godfather: Part III",
        "剧情犯罪"
    ],
    [
        255958,
        8.6,
        137,
        "海边的曼彻斯特 Manchester by the Sea",
        "剧情家庭"
    ],
    [
        232794,
        8.8,
        103,
        "玩具总动员3 Toy Story 3",
        "喜剧动画奇幻冒险"
    ],
    [
        297452,
        8.6,
        98,
        "花样年华 花樣年華",
        "剧情爱情"
    ],
    [
        102227,
        9,
        138,
        "完美的世界 A Perfect World",
        "剧情犯罪"
    ],
    [
        230283,
        8.7,
        117,
        "达拉斯买家俱乐部 Dallas Buyers Club",
        "剧情同性传记"
    ],
    [
        125525,
        8.9,
        132,
        "虎口脱险 La grande vadrouille",
        "喜剧战争"
    ],
    [
        340995,
        8.5,
        123,
        "恋恋笔记本 The Notebook",
        "剧情爱情"
    ],
    [
        168887,
        8.7,
        133,
        "燃情岁月 Legends of the Fall",
        "剧情爱情家庭西部"
    ],
    [
        139170,
        8.7,
        99,
        "二十二",
        "纪录片"
    ],
    [
        109695,
        9,
        103,
        "雨中曲 Singin' in the Rain",
        "喜剧爱情歌舞"
    ],
    [
        330806,
        8.5,
        81,
        "冰川时代 Ice Age",
        "喜剧动画冒险"
    ],
    [
        129645,
        8.8,
        132,
        "我是山姆 I Am Sam",
        "剧情家庭"
    ],
    [
        219472,
        8.6,
        98,
        "穿越时空的少女 時をかける少女",
        "剧情爱情科幻动画"
    ],
    [
        149748,
        8.8,
        108,
        "魂断蓝桥 Waterloo Bridge",
        "剧情爱情战争"
    ],
    [
        283389,
        8.5,
        94,
        "猜火车 Trainspotting",
        "剧情犯罪"
    ],
    [
        228262,
        8.6,
        146,
        "人工智能 Artificial Intelligence: AI",
        "剧情科幻冒险"
    ],
    [
        289410,
        8.7,
        95,
        "头脑特工队 Inside Out",
        "喜剧动画冒险"
    ],
    [
        309968,
        8.6,
        163,
        "被解救的姜戈 Django Unchained",
        "剧情动作西部冒险"
    ],
    [
        285698,
        8.6,
        107,
        "爆裂鼓手 Whiplash",
        "剧情音乐"
    ],
    [
        252829,
        8.7,
        101,
        "无敌破坏王 Wreck-It Ralph",
        "喜剧动画奇幻冒险"
    ],
    [
        618424,
        8.4,
        106,
        "你的名字。 君の名は。",
        "剧情爱情动画"
    ],
    [
        123643,
        8.9,
        81,
        "未麻的部屋 Perfect Blue",
        "动画惊悚奇幻"
    ],
    [
        154261,
        8.7,
        88,
        "罗生门 羅生門",
        "剧情悬疑犯罪"
    ],
    [
        255893,
        8.5,
        94,
        "阿飞正传 阿飛正傳",
        "剧情爱情犯罪"
    ],
    [
        325080,
        8.4,
        147,
        "香水 Perfume: The Story of a Murderer",
        "剧情犯罪奇幻"
    ],
    [
        156295,
        8.7,
        107,
        "浪潮 Die Welle",
        "剧情惊悚"
    ],
    [
        311144,
        8.5,
        124,
        "朗读者 The Reader",
        "剧情爱情"
    ],
    [
        195546,
        8.8,
        118,
        "房间 Room",
        "剧情家庭"
    ],
    [
        310619,
        8.6,
        114,
        "模仿游戏 The Imitation Game",
        "剧情同性传记战争"
    ],
    [
        160531,
        8.8,
        116,
        "一个叫欧维的男人决定去死 En man som heter Ove",
        "剧情"
    ],
    [
        396054,
        8.4,
        99,
        "恐怖游轮 Triangle",
        "剧情悬疑惊悚"
    ],
    [
        79149,
        9.1,
        107,
        "忠犬八公物语 ハチ公物語",
        "剧情"
    ],
    [
        153524,
        8.7,
        85,
        "可可西里",
        "剧情犯罪"
    ],
    [
        239385,
        8.5,
        103,
        "魔女宅急便 魔女の宅急便",
        "动画奇幻冒险"
    ],
    [
        271699,
        8.6,
        97,
        "完美陌生人 Perfetti sconosciuti",
        "剧情喜剧"
    ],
    [
        102687,
        8.9,
        65,
        "哪吒闹海",
        "动画奇幻冒险"
    ],
    [
        201597,
        8.6,
        122,
        "战争之王 Lord of War",
        "剧情犯罪"
    ],
    [
        153755,
        8.7,
        123,
        "一次别离 جدایی نادر از سیمین",
        "剧情家庭"
    ],
    [
        230244,
        8.5,
        119,
        "谍影重重 The Bourne Identity",
        "动作悬疑惊悚"
    ],
    [
        192022,
        8.6,
        108,
        "谍影重重2 The Bourne Supremacy",
        "动作悬疑惊悚"
    ],
    [
        129806,
        8.8,
        237,
        "牯岭街少年杀人事件 牯嶺街少年殺人事件",
        "剧情犯罪"
    ],
    [
        103460,
        8.9,
        165,
        "地球上的星星 Taare Zameen Par",
        "剧情家庭儿童"
    ],
    [
        96586,
        8.9,
        69,
        "追随 Following",
        "悬疑惊悚犯罪"
    ],
    [
        191423,
        8.6,
        129,
        "黑客帝国3：矩阵革命 The Matrix Revolutions",
        "动作科幻"
    ],
    [
        200214,
        8.6,
        112,
        "撞车 Crash",
        "剧情犯罪"
    ],
    [
        103446,
        8.9,
        109,
        "惊魂记 Psycho",
        "悬疑惊悚恐怖"
    ],
    [
        175104,
        8.7,
        127,
        "海街日记 海街diary",
        "剧情家庭"
    ],
    [
        268107,
        8.5,
        99,
        "青蛇",
        "剧情奇幻古装"
    ],
    [
        130671,
        8.7,
        102,
        "梦之安魂曲 Requiem for a Dream",
        "剧情"
    ],
    [
        218600,
        8.5,
        159,
        "小萝莉的猴神大叔 Bajrangi Bhaijaan",
        "剧情喜剧动作"
    ],
    [
        211987,
        8.5,
        104,
        "再次出发之纽约遇见你 Begin Again",
        "喜剧爱情音乐"
    ],
    [
        112466,
        8.8,
        115,
        "步履不停 歩いても 歩いても",
        "剧情家庭"
    ],
    [
        224418,
        8.5,
        88,
        "新龙门客栈 新龍門客棧",
        "剧情动作武侠古装"
    ],
    [
        469714,
        8.4,
        93,
        "源代码 Source Code",
        "科幻悬疑惊悚"
    ],
    [
        169960,
        8.6,
        137,
        "终结者2：审判日 Terminator 2: Judgment Day",
        "动作科幻"
    ],
    [
        62834,
        9.2,
        136,
        "东京物语 東京物語",
        "剧情家庭"
    ],
    [
        550470,
        8.3,
        118,
        "初恋这件小事 สิ่งเล็กเล็กที่เรียกว่า...รัก",
        "剧情喜剧爱情"
    ],
    [
        385178,
        8.3,
        106,
        "疯狂的石头",
        "喜剧犯罪"
    ],
    [
        55644,
        9.2,
        87,
        "城市之光 City Lights",
        "剧情喜剧爱情"
    ],
    [
        142300,
        8.8,
        109,
        "爱在午夜降临前 Before Midnight",
        "剧情爱情"
    ],
    [
        260606,
        8.5,
        153,
        "无耻混蛋 Inglourious Basterds",
        "剧情犯罪"
    ],
    [
        127074,
        8.7,
        189,
        "绿里奇迹 The Green Mile",
        "剧情悬疑犯罪奇幻"
    ],
    [
        122998,
        8.7,
        130,
        "末路狂花 Thelma & Louise",
        "剧情惊悚犯罪"
    ],
    [
        216576,
        8.5,
        87,
        "这个男人来自地球 The Man from Earth",
        "剧情科幻"
    ],
    [
        361272,
        8.3,
        63,
        "秒速5厘米 秒速5センチメートル",
        "剧情爱情动画"
    ],
    [
        164115,
        8.6,
        136,
        "勇闯夺命岛 The Rock",
        "动作冒险"
    ],
    [
        184142,
        8.5,
        115,
        "E.T. 外星人 E.T.: The Extra-Terrestrial",
        "剧情科幻"
    ],
    [
        386892,
        8.7,
        115,
        "三块广告牌 Three Billboards Outside Ebbing, Missouri",
        "剧情犯罪"
    ],
    [
        230350,
        8.4,
        89,
        "彗星来的那一夜 Coherence",
        "科幻悬疑惊悚"
    ],
    [
        246707,
        8.4,
        138,
        "变脸 Face/Off",
        "动作科幻惊悚犯罪"
    ],
    [
        62402,
        9.1,
        161,
        "黄金三镖客 Il buono, il brutto, il cattivo.",
        "西部冒险"
    ],
    [
        213150,
        8.5,
        136,
        "发条橙 A Clockwork Orange",
        "剧情科幻犯罪"
    ],
    [
        163530,
        8.6,
        143,
        "血钻 Blood Diamond",
        "剧情惊悚冒险"
    ],
    [
        144249,
        8.6,
        102,
        "卡萨布兰卡 Casablanca",
        "剧情爱情战争"
    ],
    [
        153054,
        8.8,
        128,
        "聚焦 Spotlight",
        "剧情传记"
    ],
    [
        116903,
        8.7,
        132,
        "碧海蓝天 Le grand bleu",
        "剧情爱情"
    ],
    [
        214337,
        8.5,
        122,
        "美国丽人 American Beauty",
        "剧情爱情家庭"
    ],
    [
        141549,
        8.6,
        106,
        "非常嫌疑犯 The Usual Suspects",
        "剧情悬疑惊悚犯罪"
    ],
    [
        393642,
        8.3,
        118,
        "国王的演讲 The King's Speech",
        "剧情传记历史"
    ],
    [
        143395,
        8.6,
        144,
        "黑鹰坠落 Black Hawk Down",
        "动作历史战争"
    ],
    [
        183332,
        8.6,
        116,
        "海盗电台 The Boat That Rocked",
        "剧情喜剧音乐"
    ],
    [
        71911,
        9,
        118,
        "我爱你 그대를 사랑합니다",
        "剧情爱情"
    ],
    [
        109519,
        8.7,
        106,
        "千钧一发 Gattaca",
        "剧情科幻惊悚"
    ],
    [
        147415,
        8.6,
        148,
        "荒野生存 Into the Wild",
        "剧情传记冒险"
    ],
    [
        118252,
        8.7,
        148,
        "2001太空漫游 2001: A Space Odyssey",
        "科幻惊悚冒险"
    ],
    [
        195337,
        8.5,
        162,
        "英国病人 The English Patient",
        "剧情爱情战争"
    ],
    [
        158715,
        8.5,
        97,
        "遗愿清单 The Bucket List",
        "剧情喜剧冒险"
    ],
    [
        68870,
        9,
        111,
        "海蒂和爷爷 Heidi",
        "剧情家庭冒险"
    ],
    [
        161546,
        8.5,
        143,
        "荒岛余生 Cast Away",
        "剧情冒险"
    ],
    [
        99170,
        8.9,
        140,
        "勇士 Warrior",
        "剧情家庭运动"
    ],
    [
        117650,
        8.7,
        84,
        "枪火 鎗火",
        "剧情动作犯罪"
    ],
    [
        57425,
        9.1,
        98,
        "迁徙的鸟 Le peuple migrateur",
        "纪录片"
    ],
    [
        123701,
        8.6,
        95,
        "叫我第一名 Front of the Class",
        "剧情传记"
    ],
    [
        117681,
        8.6,
        148,
        "燕尾蝶 スワロウテイル",
        "剧情犯罪"
    ],
    [
        268490,
        8.3,
        147,
        "穆赫兰道 Mulholland Dr.",
        "剧情悬疑惊悚"
    ]
]

let categories = ['全部', '剧情', '喜剧', '动作', '爱情', '科幻', '动画', '悬疑', '惊悚', '恐怖', '犯罪', '同性', '音乐', '歌舞', '传记', '历史', '战争', '西部', '奇幻', '冒险', '灾难', '武侠', '情色'];